const targetArr = [5, 8, 6, 3, 9, 2, 1, 7];
import Sort from './../Sort';

/**
 * 相邻的元素两两比较 当一个元素大于右侧相邻? 交换位置:位置不变
 * 5 8 6 3 9 2 1 7
 * ---------------------------第1轮
 * 8和6比较交换 arr[1]和arr[2]
 * 5  8  6   3  9  2  1  7
 * 5 [8  6]  3  9  2  1  7
 * 5  6  8   3  9  2  1  7
 * 8和3比较交换 arr[2]和arr[3]
 * 5  6  8   3  9  2  1  7
 * 5  6  [8  3] 9  2  1  7
 * 5  6  3   8  9  2  1  7
 * 8和9比较不变 arr[3]和arr[4]
 * 5  6  3   8  9  2  1  7
 * 5  6  3  [8  9] 2  1  7
 * 5  6  3  8   9  2  1  7
 * 9和2比较交换 arr[4]和arr[5]
 * 5  6  3  8   9  2  1  7
 * 5  6  3  8   [9 2] 1  7
 * 5  6  3  8   2  9  1  7
 * 9和1比较交换 arr[5]和arr[6]
 * 5  6  3  8   2  9  1  7
 * 5  6  3  8   2  [9 1]  7
 * 5  6  3  8   2  1  9  7
 * 9和7比较交换 arr[6]和arr[7]
 * 5  6  3  8   2  1   9  7
 * 5  6  3  8   2  1  [9  7]
 * 5  6  3  8   2  1   7  9
 * ----------------------------------
 * 5  8  6  3   9  2   1  7 -- old
 * 5  6  3  8   2  1   7  9
 */

export default class BubbleSort extends Sort {
  sort() {}
}
